app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings

    # get which movie field to sort by
    order_field = sort_column
    direction = sort_direction

    # filter by rating criteria
    ratings = params[:ratings] || session[:ratings]

    unless ratings.nil?
      # only get specified ratings
      session[:ratings] = ratings
      @movies = Movie.find_all_by_rating(ratings.keys, :order => order_field + " " + direction)
    else
      # get all ratings by default
      session[:ratings] = Hash.new
      @all_ratings.each do |rating|
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY rating asc
SELECT "movies".* FROM "movies" ORDER BY release_date desc